Table of Contents
 Interface IIdeaWorkPlane
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
public interface IIdeaWorkPlane : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Normal
Workplane normal vector
IdeaVector3D Normal { get; }
Property Value
IdeaVector3D
 Origin
Workplane origin point
IIdeaNode Origin { get; }
Property Value
IIdeaNode
 Edit this page